toirnewgdktest/src/InformationRegisters/торо_УведомленияПользователей/торо_УведомленияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_УведомленияПользователей</name>
  <resources>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТелоПисьма</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ID_уведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособУведомления</name>
    <type>
      <types>EnumRef.торо_СпособыУведомленияПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

toirnewgdktest/src/InformationRegisters/торо_УведомленияПользователей/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Процедура - Записать уведомления
//
// Параметры:
//  МассивВыполненныхУведомлений - Массив - Массив выполненных записываемых уведомлений.
Процедура ЗаписатьУведомления(МассивВыполненныхУведомлений) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекДата = ТекущаяДата();
	
	Для каждого Уведомление Из МассивВыполненныхУведомлений Цикл
		
		Запись = РегистрыСведений.торо_УведомленияПользователей.СоздатьМенеджерЗаписи();
		Запись.Пользователь      = Уведомление.Пользователь;
		Запись.ID_уведомления    = Уведомление.ID_уведомления;
		Запись.СпособУведомления = Уведомление.СпособУведомления;
		Запись.Источник          = Уведомление.Источник;
		Запись.ТелоПисьма		 = Уведомление.ТелоПисьма;
		Запись.ТемаПисьма		 = Уведомление.ТемаПисьма;
		Запись.ДатаУведомления   = ТекДата;
		Запись.Записать();

	КонецЦикла; 
	
	
КонецПроцедуры

// Процедура - Удалить уведомления
//
// Параметры:
//  МассивВыполненныхУведомлений - Массив - Массив выполненных удаляемых уведомлений.
Процедура УдалитьУведомления(МассивВыполненныхУведомлений) Экспорт
	// по аналогии с 1С:Документооборот

	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Уведомление Из МассивВыполненныхУведомлений Цикл
		
		Запись = РегистрыСведений.торо_УведомленияПользователей.СоздатьМенеджерЗаписи();
		Запись.Пользователь      = Уведомление.Пользователь;
		Запись.ID_уведомления    = Уведомление.ID_уведомления;
		Запись.СпособУведомления = Уведомление.СпособУведомления;
		Запись.Источник          = Уведомление.Источник;
		Запись.Удалить();

	КонецЦикла; 
	
	
КонецПроцедуры
#КонецОбласти
